<net name="image-classification" version="2" batch="1">
  <layers>
    <layer name="data" type="Input" id="1" precision="FP16">
      <output>
        <port id="1">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_bn_data" type="ScaleShift" id="2" precision="FP16">
      <input>
        <port id="3">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="2">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </output>
      <weights size="6" offset="0"/>
      <biases size="6" offset="6"/>
    </layer>
    <layer name="Convolution_conv0" type="Convolution" id="3" precision="FP16">
      <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="64" group="1"/>
      <input>
        <port id="5">
          <dim>1</dim>
          <dim>3</dim>
          <dim>300</dim>
          <dim>300</dim>
        </port>
      </input>
      <output>
        <port id="4">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
      <weights size="18816" offset="12"/>
      <biases size="128" offset="18828"/>
    </layer>
    <layer name="ReLU_relu0" type="ReLU" id="4" precision="FP16">
      <input>
        <port id="7">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="6">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </output>
    </layer>
    <layer name="Pooling_pooling0" type="Pooling" id="5" precision="FP16">
      <pooling_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" rounding-type="ceil" pool-method="max"/>
      <input>
        <port id="9">
          <dim>1</dim>
          <dim>64</dim>
          <dim>150</dim>
          <dim>150</dim>
        </port>
      </input>
      <output>
        <port id="8">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit1_bn1" type="ScaleShift" id="6" precision="FP16">
      <input>
        <port id="11">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="10">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="128" offset="18956"/>
      <biases size="128" offset="19084"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu1" type="ReLU" id="7" precision="FP16">
      <input>
        <port id="13">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="12">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv1" type="Convolution" id="8" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
      <input>
        <port id="15">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="14">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="8192" offset="19212"/>
      <biases size="128" offset="27404"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu2" type="ReLU" id="9" precision="FP16">
      <input>
        <port id="17">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="16">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv2" type="Convolution" id="10" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
      <input>
        <port id="19">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="18">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="73728" offset="27532"/>
      <biases size="128" offset="101260"/>
    </layer>
    <layer name="ReLU_stage1_unit1_relu3" type="ReLU" id="11" precision="FP16">
      <input>
        <port id="21">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="20">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit1_conv3" type="Convolution" id="12" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="23">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="22">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="101388"/>
    </layer>
    <layer name="Convolution_stage1_unit1_sc" type="Convolution" id="13" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="25">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="24">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="134156"/>
    </layer>
    <layer name="Eltwise__plus0" type="Eltwise" id="14" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="27">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="28">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="26">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit2_bn1" type="ScaleShift" id="15" precision="FP16">
      <input>
        <port id="30">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="29">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="512" offset="166924"/>
      <biases size="512" offset="167436"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu1" type="ReLU" id="16" precision="FP16">
      <input>
        <port id="32">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="31">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv1" type="Convolution" id="17" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
      <input>
        <port id="34">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="33">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="167948"/>
      <biases size="128" offset="200716"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu2" type="ReLU" id="18" precision="FP16">
      <input>
        <port id="36">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="35">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv2" type="Convolution" id="19" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
      <input>
        <port id="38">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="37">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="73728" offset="200844"/>
      <biases size="128" offset="274572"/>
    </layer>
    <layer name="ReLU_stage1_unit2_relu3" type="ReLU" id="20" precision="FP16">
      <input>
        <port id="40">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="39">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit2_conv3" type="Convolution" id="21" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="42">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="41">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="274700"/>
    </layer>
    <layer name="Eltwise__plus1" type="Eltwise" id="22" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="44">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="45">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="43">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage1_unit3_bn1" type="ScaleShift" id="23" precision="FP16">
      <input>
        <port id="47">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="46">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="512" offset="307468"/>
      <biases size="512" offset="307980"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu1" type="ReLU" id="24" precision="FP16">
      <input>
        <port id="49">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="48">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv1" type="Convolution" id="25" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
      <input>
        <port id="51">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="50">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="308492"/>
      <biases size="128" offset="341260"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu2" type="ReLU" id="26" precision="FP16">
      <input>
        <port id="53">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="52">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv2" type="Convolution" id="27" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
      <input>
        <port id="55">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="54">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="73728" offset="341388"/>
      <biases size="128" offset="415116"/>
    </layer>
    <layer name="ReLU_stage1_unit3_relu3" type="ReLU" id="28" precision="FP16">
      <input>
        <port id="57">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="56">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage1_unit3_conv3" type="Convolution" id="29" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="59">
          <dim>1</dim>
          <dim>64</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="58">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="32768" offset="415244"/>
    </layer>
    <layer name="Eltwise__plus2" type="Eltwise" id="30" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="61">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
        <port id="62">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="60">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit1_bn1" type="ScaleShift" id="31" precision="FP16">
      <input>
        <port id="64">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="63">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="512" offset="448012"/>
      <biases size="512" offset="448524"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu1" type="ReLU" id="32" precision="FP16">
      <input>
        <port id="66">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="65">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv1" type="Convolution" id="33" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
      <input>
        <port id="68">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="67">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
      <weights size="65536" offset="449036"/>
      <biases size="256" offset="514572"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu2" type="ReLU" id="34" precision="FP16">
      <input>
        <port id="70">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="69">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv2" type="Convolution" id="35" precision="FP16">
      <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
      <input>
        <port id="72">
          <dim>1</dim>
          <dim>128</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="71">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="294912" offset="514828"/>
      <biases size="256" offset="809740"/>
    </layer>
    <layer name="ReLU_stage2_unit1_relu3" type="ReLU" id="36" precision="FP16">
      <input>
        <port id="74">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="73">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit1_conv3" type="Convolution" id="37" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
      <input>
        <port id="76">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="75">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="809996"/>
    </layer>
    <layer name="Convolution_stage2_unit1_sc" type="Convolution" id="38" precision="FP16">
      <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
      <input>
        <port id="78">
          <dim>1</dim>
          <dim>256</dim>
          <dim>75</dim>
          <dim>75</dim>
        </port>
      </input>
      <output>
        <port id="77">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="941068"/>
    </layer>
    <layer name="Eltwise__plus3" type="Eltwise" id="39" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="80">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="81">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="79">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit2_bn1" type="ScaleShift" id="40" precision="FP16">
      <input>
        <port id="83">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="82">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="1024" offset="1203212"/>
      <biases size="1024" offset="1204236"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu1" type="ReLU" id="41" precision="FP16">
      <input>
        <port id="85">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="84">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv1" type="Convolution" id="42" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
      <input>
        <port id="87">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="86">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="1205260"/>
      <biases size="256" offset="1336332"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu2" type="ReLU" id="43" precision="FP16">
      <input>
        <port id="89">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="88">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv2" type="Convolution" id="44" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
      <input>
        <port id="91">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="90">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="294912" offset="1336588"/>
      <biases size="256" offset="1631500"/>
    </layer>
    <layer name="ReLU_stage2_unit2_relu3" type="ReLU" id="45" precision="FP16">
      <input>
        <port id="93">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="92">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit2_conv3" type="Convolution" id="46" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
      <input>
        <port id="95">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="94">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="1631756"/>
    </layer>
    <layer name="Eltwise__plus4" type="Eltwise" id="47" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="97">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="98">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="96">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit3_bn1" type="ScaleShift" id="48" precision="FP16">
      <input>
        <port id="100">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="99">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="1024" offset="1762828"/>
      <biases size="1024" offset="1763852"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu1" type="ReLU" id="49" precision="FP16">
      <input>
        <port id="102">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="101">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv1" type="Convolution" id="50" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
      <input>
        <port id="104">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="103">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="1764876"/>
      <biases size="256" offset="1895948"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu2" type="ReLU" id="51" precision="FP16">
      <input>
        <port id="106">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="105">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv2" type="Convolution" id="52" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
      <input>
        <port id="108">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="107">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="294912" offset="1896204"/>
      <biases size="256" offset="2191116"/>
    </layer>
    <layer name="ReLU_stage2_unit3_relu3" type="ReLU" id="53" precision="FP16">
      <input>
        <port id="110">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="109">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit3_conv3" type="Convolution" id="54" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
      <input>
        <port id="112">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="111">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="2191372"/>
    </layer>
    <layer name="Eltwise__plus5" type="Eltwise" id="55" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="114">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="115">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="113">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage2_unit4_bn1" type="ScaleShift" id="56" precision="FP16">
      <input>
        <port id="117">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="116">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="1024" offset="2322444"/>
      <biases size="1024" offset="2323468"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu1" type="ReLU" id="57" precision="FP16">
      <input>
        <port id="119">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="118">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv1" type="Convolution" id="58" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
      <input>
        <port id="121">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="120">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="2324492"/>
      <biases size="256" offset="2455564"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu2" type="ReLU" id="59" precision="FP16">
      <input>
        <port id="123">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="122">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv2" type="Convolution" id="60" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
      <input>
        <port id="125">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="124">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="294912" offset="2455820"/>
      <biases size="256" offset="2750732"/>
    </layer>
    <layer name="ReLU_stage2_unit4_relu3" type="ReLU" id="61" precision="FP16">
      <input>
        <port id="127">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="126">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage2_unit4_conv3" type="Convolution" id="62" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="512" group="1"/>
      <input>
        <port id="129">
          <dim>1</dim>
          <dim>128</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="128">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="131072" offset="2750988"/>
    </layer>
    <layer name="Eltwise__plus6" type="Eltwise" id="63" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="131">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
        <port id="132">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="130">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit1_bn1" type="ScaleShift" id="64" precision="FP16">
      <input>
        <port id="134">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="133">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="1024" offset="2882060"/>
      <biases size="1024" offset="2883084"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu1" type="ReLU" id="65" precision="FP16">
      <input>
        <port id="136">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="135">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv1" type="Convolution" id="66" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="138">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="137">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
      <weights size="262144" offset="2884108"/>
      <biases size="512" offset="3146252"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu2" type="ReLU" id="67" precision="FP16">
      <input>
        <port id="140">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="139">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv2" type="Convolution" id="68" precision="FP16">
      <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
      <input>
        <port id="142">
          <dim>1</dim>
          <dim>256</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="141">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1179648" offset="3146764"/>
      <biases size="512" offset="4326412"/>
    </layer>
    <layer name="ReLU_stage3_unit1_relu3" type="ReLU" id="69" precision="FP16">
      <input>
        <port id="144">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="143">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit1_conv3" type="Convolution" id="70" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
      <input>
        <port id="146">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="145">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="4326924"/>
    </layer>
    <layer name="Convolution_stage3_unit1_sc" type="Convolution" id="71" precision="FP16">
      <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
      <input>
        <port id="148">
          <dim>1</dim>
          <dim>512</dim>
          <dim>38</dim>
          <dim>38</dim>
        </port>
      </input>
      <output>
        <port id="147">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1048576" offset="4851212"/>
    </layer>
    <layer name="Eltwise__plus7" type="Eltwise" id="72" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="150">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="151">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="149">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit2_bn1" type="ScaleShift" id="73" precision="FP16">
      <input>
        <port id="153">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="152">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2048" offset="5899788"/>
      <biases size="2048" offset="5901836"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu1" type="ReLU" id="74" precision="FP16">
      <input>
        <port id="155">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="154">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv1" type="Convolution" id="75" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="157">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="156">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="5903884"/>
      <biases size="512" offset="6428172"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu2" type="ReLU" id="76" precision="FP16">
      <input>
        <port id="159">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="158">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv2" type="Convolution" id="77" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
      <input>
        <port id="161">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="160">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1179648" offset="6428684"/>
      <biases size="512" offset="7608332"/>
    </layer>
    <layer name="ReLU_stage3_unit2_relu3" type="ReLU" id="78" precision="FP16">
      <input>
        <port id="163">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="162">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit2_conv3" type="Convolution" id="79" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
      <input>
        <port id="165">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="164">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="7608844"/>
    </layer>
    <layer name="Eltwise__plus8" type="Eltwise" id="80" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="167">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="168">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="166">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit3_bn1" type="ScaleShift" id="81" precision="FP16">
      <input>
        <port id="170">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="169">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2048" offset="8133132"/>
      <biases size="2048" offset="8135180"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu1" type="ReLU" id="82" precision="FP16">
      <input>
        <port id="172">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="171">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv1" type="Convolution" id="83" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="174">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="173">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="8137228"/>
      <biases size="512" offset="8661516"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu2" type="ReLU" id="84" precision="FP16">
      <input>
        <port id="176">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="175">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv2" type="Convolution" id="85" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
      <input>
        <port id="178">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="177">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1179648" offset="8662028"/>
      <biases size="512" offset="9841676"/>
    </layer>
    <layer name="ReLU_stage3_unit3_relu3" type="ReLU" id="86" precision="FP16">
      <input>
        <port id="180">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="179">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit3_conv3" type="Convolution" id="87" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="1024" group="1"/>
      <input>
        <port id="182">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="181">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="9842188"/>
    </layer>
    <layer name="Eltwise__plus9" type="Eltwise" id="88" precision="FP16">
      <elementwise_data operation=""/>
      <input>
        <port id="184">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
        <port id="185">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="183">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="ScaleShift_stage3_unit4_bn1" type="ScaleShift" id="89" precision="FP16">
      <input>
        <port id="187">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="186">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="2048" offset="10366476"/>
      <biases size="2048" offset="10368524"/>
    </layer>
    <layer name="ReLU_stage3_unit4_relu1" type="ReLU" id="90" precision="FP16">
      <input>
        <port id="189">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="188">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit4_conv1" type="Convolution" id="91" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="256" group="1"/>
      <input>
        <port id="191">
          <dim>1</dim>
          <dim>1024</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="190">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="524288" offset="10370572"/>
      <biases size="512" offset="10894860"/>
    </layer>
    <layer name="ReLU_stage3_unit4_relu2" type="ReLU" id="92" precision="FP16">
      <input>
        <port id="193">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="192">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
    </layer>
    <layer name="Convolution_stage3_unit4_conv2" type="Convolution" id="93" precision="FP16">
      <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="256" group="1"/>
      <input>
        <port id="195">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </input>
      <output>
        <port id="194">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
          <dim>19</dim>
        </port>
      </output>
      <weights size="1179648" offset="10895372"/>
      <biases size="512" offset="12075020"/>
    </layer>
    <layer name="ReLU_stage3_unit4_relu3" type="ReLU" id="94" precision="FP16">
      <input>
        <port id="197">
          <dim>1</dim>
          <dim>256</dim>
          <dim>19</dim>
